// ========================================
// GGN Docs
// GLOBAL STATE
// ========================================


// ========================================
// DOCUMENTS
// ========================================

let documents = [];


// ========================================
// INSPECTION
// ========================================

// รายการตรวจทั้งหมด
let inspectionRecords = [];


// เขต
let inspectionZones = [];


// จุดตรวจ
let inspectionLocations = [];


// ผู้ตรวจ
let inspectionInspectors = [];


// รายการหัวข้อตรวจ
let inspectionItems = [];


// ========================================
// INSPECTION SETTINGS
// ========================================

// ใช้ตรวจสอบว่าโหลด Settings แล้วหรือยัง
let inspectionSettingsLoaded = false;


// ========================================
// CURRENT INSPECTION
// ========================================

// ข้อมูลการตรวจที่กำลังแก้ไข / เปิดดู
let currentInspectionRecord = null;


// ========================================
// CURRENT USER
// ========================================

// ผู้ใช้งานที่ Login อยู่
let currentUser = null;


// ========================================
// APPLICATION STATE
// ========================================

// หน้าที่กำลังเปิดอยู่
let currentPage = "";


// ========================================
// DOCUMENT SEARCH
// ========================================

// คำค้นหาเอกสาร
let documentSearchTerm = "";


// ========================================
// INSPECTION SEARCH
// ========================================

// คำค้นหารายการตรวจ
let inspectionSearchTerm = "";


// ========================================
// INSPECTION FILTER
// ========================================

// ตัวกรองเขต
let inspectionFilterZone = "";


// ตัวกรองวันที่
let inspectionFilterDate = "";


// ตัวกรองผู้ตรวจ
let inspectionFilterInspector = "";