// ========================================
// GGN DOCS
// STATE
// ========================================


// ======================================================
// DOCUMENT SYSTEM
// ======================================================

// รายการเอกสารทั้งหมด
let documents = [];


// ======================================================
// INSPECTION SYSTEM
// ======================================================

// รายการสถานที่ตรวจ
let inspectionLocations = [];


// รายชื่อผู้ตรวจ
let inspectionInspectors = [];


// รายการหัวข้อการตรวจ
let inspectionItems = [];


// รายการ Inspection ที่โหลดจากระบบ
let inspectionRecords = [];


// สถานะว่า Inspection Settings โหลดแล้วหรือยัง
let inspectionSettingsLoaded = false;


// ======================================================
// FM-OP-11 GENERATOR
// ======================================================

// รายการตรวจที่ค้นพบ
let fmop11Records = [];


// รายการที่ผู้ใช้เลือก
let fmop11SelectedRecords = [];